
需求原始内容：
XQGZ2026050602632
沟通销售部，小微业务销售贡献值及激励积分客户经理与CTO的外包合同结算分成比例需进行测算，
需要提取2025年1月-2026年4月的小微业务销售贡献值及激励积分，
需要包含业务接入号、对应销售贡献值、激励积分、贡献值与积分归属人。



需求梳理：
经与需求方沟通，
数据周期：2025年1月-2026年4月
数据来源：ads_yz_score_all_list (发展存量积分清单)
口径：限制小微业务
1. 圈定一次性小微销售品统计
2. prod_name2='云业务' and prod_id = '1054'
3. prod_name2= '增值业务' and prod_name3 ='网络维护服务' and date_format(open_date,'yyyyMM')>='202602'
需要字段：号码，揽装人，销售贡献值（价值积分），激励积分，小微类型


输出字段：
号码，揽装人，价值积分，激励积分，小微类型




-- 提取对应周期的所有记录
set hive.fetch.task.conversion=none;
create table tmp_yz_XQGZ2026050602632_list1 as 
select * from ads_yz_score_all_list 
where par_month_id between 202501 and 202604;



-- 限制小微业务口径，按号码级汇总积分
drop table if exists ads_yz_XQGZ2026050602632_list11;
create table ads_yz_XQGZ2026050602632_list11 as
select
  par_month_id,
  acc_nbr,
  serv_id,
  sales_name,
  sales_code,
    case 
    when jl_points_desc RLIKE 'DM0001-876-1-1|DM0001-876-1-2|DM0001-876-1-3|DM0001-876-1-4|DM0001-876-1-5|DM0001-871-1-1|DM0001-871-1-2|DM0001-871-1-3|DM0001-871-1-4|DM0001-871-1-5|DM0001-871-1-6|DM0001-871-1-7|DM0001-871-1-8|DM0001-874-1-1|DM0001-874-1-2|DM0001-874-1-3|DM0001-874-1-4|DM0001-874-1-5|DM0001-874-1-6|DM0001-874-1-7|DM0001-874-1-8|DM0001-875-1-1|DM0001-875-1-2|DM0001-875-1-3|DM0001-875-1-4|DM0001-875-1-5|DM0001-875-1-6|DM0001-875-1-7|DM0001-875-1-8|DM0001-873-1-1|DM0001-873-1-2|DM0001-873-1-3|DM0001-873-1-4|DM0001-873-1-5|DM0001-873-1-6|DM0001-873-1-7|DM0001-873-1-8|DM0001-868-1-7|DM0001-868-1-8|DM0001-868-1-6|DM0001-868-1-3|DM0001-868-1-5|DM0001-868-1-4|DM0001-868-1-1|DM0001-868-1-2|DM0001-872-1-1|DM0001-872-1-2|DM0001-872-1-3|DM0001-872-1-4|DM0001-872-1-5|DM0001-872-1-6|DM0001-872-1-7|DM0001-872-1-8|DM0001-868-1-9|DM0001-868-1-10'
    then '限制指定销售品'
    when prod_name2= '云业务' and prod_id = '1054'
    then '云业务1054'
    when prod_name2= '增值业务' and prod_name3 ='网络维护服务' and date_format(open_date,'yyyyMM')>='202602'
    then '网络维护服务'
    else '其他'
  end as match_condition,
  sum(jz_points) jz,
  sum(jl_points) jl
from
  tmp_yz_XQGZ2026050602632_list1
where
   ((prod_name2 in ('增值业务') and jl_points_desc RLIKE 'DM0001-876-1-1|DM0001-876-1-2|DM0001-876-1-3|DM0001-876-1-4|DM0001-876-1-5|DM0001-871-1-1|DM0001-871-1-2|DM0001-871-1-3|DM0001-871-1-4|DM0001-871-1-5|DM0001-871-1-6|DM0001-871-1-7|DM0001-871-1-8|DM0001-874-1-1|DM0001-874-1-2|DM0001-874-1-3|DM0001-874-1-4|DM0001-874-1-5|DM0001-874-1-6|DM0001-874-1-7|DM0001-874-1-8|DM0001-875-1-1|DM0001-875-1-2|DM0001-875-1-3|DM0001-875-1-4|DM0001-875-1-5|DM0001-875-1-6|DM0001-875-1-7|DM0001-875-1-8|DM0001-873-1-1|DM0001-873-1-2|DM0001-873-1-3|DM0001-873-1-4|DM0001-873-1-5|DM0001-873-1-6|DM0001-873-1-7|DM0001-873-1-8|DM0001-868-1-7|DM0001-868-1-8|DM0001-868-1-6|DM0001-868-1-3|DM0001-868-1-5|DM0001-868-1-4|DM0001-868-1-1|DM0001-868-1-2|DM0001-872-1-1|DM0001-872-1-2|DM0001-872-1-3|DM0001-872-1-4|DM0001-872-1-5|DM0001-872-1-6|DM0001-872-1-7|DM0001-872-1-8|DM0001-868-1-9|DM0001-868-1-10')
	   or (prod_name2= '云业务' and  prod_id = '1054')
	  or ( prod_name2= '增值业务' and prod_name3 ='网络维护服务' and date_format(open_date,'yyyyMM')>='202602'))
group by
  par_month_id,
  acc_nbr,
  serv_id,
  sales_name,
  sales_code,
   case 
    when jl_points_desc RLIKE 'DM0001-876-1-1|DM0001-876-1-2|DM0001-876-1-3|DM0001-876-1-4|DM0001-876-1-5|DM0001-871-1-1|DM0001-871-1-2|DM0001-871-1-3|DM0001-871-1-4|DM0001-871-1-5|DM0001-871-1-6|DM0001-871-1-7|DM0001-871-1-8|DM0001-874-1-1|DM0001-874-1-2|DM0001-874-1-3|DM0001-874-1-4|DM0001-874-1-5|DM0001-874-1-6|DM0001-874-1-7|DM0001-874-1-8|DM0001-875-1-1|DM0001-875-1-2|DM0001-875-1-3|DM0001-875-1-4|DM0001-875-1-5|DM0001-875-1-6|DM0001-875-1-7|DM0001-875-1-8|DM0001-873-1-1|DM0001-873-1-2|DM0001-873-1-3|DM0001-873-1-4|DM0001-873-1-5|DM0001-873-1-6|DM0001-873-1-7|DM0001-873-1-8|DM0001-868-1-7|DM0001-868-1-8|DM0001-868-1-6|DM0001-868-1-3|DM0001-868-1-5|DM0001-868-1-4|DM0001-868-1-1|DM0001-868-1-2|DM0001-872-1-1|DM0001-872-1-2|DM0001-872-1-3|DM0001-872-1-4|DM0001-872-1-5|DM0001-872-1-6|DM0001-872-1-7|DM0001-872-1-8|DM0001-868-1-9|DM0001-868-1-10'
    then '限制指定销售品'
    when prod_name2= '云业务' and prod_id = '1054'
    then '云业务1054'
    when prod_name2= '增值业务' and prod_name3 ='网络维护服务' and date_format(open_date,'yyyyMM')>='202602'
    then '网络维护服务'
    else '其他'
  end ;
  


  -- 数据输出
  select  
  par_month_id, -- 月份
  acc_nbr,  -- 号码
  serv_id,  -- 接入号
  sales_name,  -- 揽装人
  sales_code, -- 揽装工号
  match_condition, -- 条件
  jz, -- 价值积分也就是销售贡献值
  jl -- 激励积分
  from ads_yz_XQGZ2026050602632_list